## Staging: api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                           |
|--------|----------------------------------------------------------|
| add    | `aws_ssm_parameter.cloudfront_header`                    |
| update | `module.url_shortener_lambda.aws_iam_policy.policies[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.api_policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "api_policies" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:dynamodb:ca-central-1:843973686572:table/url_shortener",
              + "arn:aws:dynamodb:ca-central-1:843973686572:table/url_shortener/index/emailIndex",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:843973686572:parameter/auth_token_app",
              + "arn:aws:ssm:ca-central-1:843973686572:parameter/auth_token_notify",
              + "arn:aws:ssm:ca-central-1:843973686572:parameter/hashing_peppers",
              + "arn:aws:ssm:ca-central-1:843973686572:parameter/notify_api_key",
              + "arn:aws:ssm:ca-central-1:843973686572:parameter/notify_contact_email",
              + (known after apply),
            ]
        }
    }

  # aws_ssm_parameter.cloudfront_header will be created
  + resource "aws_ssm_parameter" "cloudfront_header" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "cloudfront_header"
      + tags           = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "url-shortener-staging"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.url_shortener_lambda.aws_iam_policy.policies[0] will be updated in-place
  ~ resource "aws_iam_policy" "policies" {
        id        = "arn:aws:iam::843973686572:policy/url-shortener-api-0"
        name      = "url-shortener-api-0"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ca-central-1:843973686572:table/url_shortener/index/emailIndex",
                          - "arn:aws:dynamodb:ca-central-1:843973686572:table/url_shortener",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ssm:GetParameters"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:843973686572:parameter/notify_contact_email",
                          - "arn:aws:ssm:ca-central-1:843973686572:parameter/notify_api_key",
                          - "arn:aws:ssm:ca-central-1:843973686572:parameter/hashing_peppers",
                          - "arn:aws:ssm:ca-central-1:843973686572:parameter/auth_token_notify",
                          - "arn:aws:ssm:ca-central-1:843973686572:parameter/auth_token_app",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "url-shortener-staging"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder"]

21 tests, 17 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
